ext_alsav/InformationRegisters/алсав_СоставИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_СоставИзделий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУзле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьВСборкеНоменклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПолуфабрикат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПродуктНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродуктХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектацииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьВСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДлительностьСборкиРазборки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностиКомплектацииПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЭтоПолуфабрикат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантКомлектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_СоставИзделий/Ext/ManagerModule.bsl
Функция ОбновитьСостав(ПродуктНоменклатура, ПродуктХарактеристика) ЭКСПОРТ
	//комплектация = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(номенклатура, характеристика);
	//Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьКомплектующиеНоменклатуры(комплектация,,1);
	
	состав = ПолучитьКомплектующиеНоменклатурыПолный(ПродуктНоменклатура, ПродуктХарактеристика, 1);
	
	нз = РегистрыСведений.алсав_СоставИзделий.СоздатьНаборЗаписей();
	нз.Отбор.ПродуктНоменклатура.Установить(ПродуктНоменклатура);
	нз.Отбор.ПродуктХарактеристика.Установить(ПродуктХарактеристика);
	
	Для Каждого стр из состав Цикл
		запись = нз.Добавить();
		ЗаполнитьЗначенияСвойств(запись,стр);
		запись.Количество = стр.Количество;
			
		запись.ПродуктНоменклатура = ПродуктНоменклатура;
		запись.ПродуктХарактеристика = ПродуктХарактеристика;
		
	КонецЦикла;
	
	нз.Записать(ИСТИНА);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка,
	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК Владелец,
	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика КАК Характеристика
	               |ИЗ
	               |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	               |ГДЕ
	               |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = ИСТИНА
				   |	И ВариантыКомплектацииНоменклатурыТовары.Номенклатура = &Номенклатура
	               |	И ВариантыКомплектацииНоменклатурыТовары.Характеристика = &Характеристика";
	
	ЗАпрос.УстановитьПараметр("Номенклатура",ПродуктНоменклатура);
	ЗАпрос.УстановитьПараметр("Характеристика",ПродуктХарактеристика);
	
	рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		ПолучитьКомплектующиеНоменклатурыПолный(рез.Владелец, рез.Характеристика);
	КонецЦикла;

КонецФункции




Функция ПолучитьКомплектующиеНоменклатурыПолный(номенклатура, характеристика, Количество = 1, ПутьВСборке = "", ПутьВСборкеНоменклатура = "") Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК ВариантКомплектацииНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	МИНИМУМ(Товары.НомерСтроки) КАК НомерСтроки,
	|	Товары.Упаковка КАК Упаковка,
	|	СУММА(&КоличествоКомплектов * Товары.КоличествоУпаковок / Товары.Ссылка.Количество) КАК КоличествоУпаковок,
	|	СУММА(&КоличествоКомплектов * Товары.Количество / Товары.Ссылка.Количество) КАК Количество,
	|	СУММА(Товары.ДоляСтоимости) КАК ДоляСтоимости,
	|	ВЫБОР
	|		КОГДА НЕ Товары.Ссылка.ЭтоМатериалы
	|			ТОГДА Товары.Ссылка.Основной
	|		ИНАЧЕ Товары.Ссылка.ОсобенностиКомплектацииПроект В (&мПроектПустой)
	|	КОНЕЦ КАК Основной,
	|	Товары.Ссылка.ЭтоМатериалы КАК ЭтоМатериалы,
	|	Товары.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|	Товары.Ссылка.Владелец КАК УзелНоменклатура,
	|	Товары.Ссылка.Характеристика КАК УзелХарактеристика
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка.Владелец = &номенклатура
	|	И Товары.Ссылка.Характеристика = &характеристика
	|	И (Товары.Ссылка.Основной
	|			ИЛИ Товары.Ссылка.ЭтоМатериалы)
	|	И НЕ Товары.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Упаковка,
	|	Товары.Характеристика,
	|	Товары.ЭтоПолуфабрикат,
	|	Товары.Ссылка,
	|	Товары.Номенклатура,
	|	Товары.Ссылка.ЭтоМатериалы,
	|	Товары.Ссылка.Владелец,
	|	Товары.Ссылка.Характеристика,
	|	ВЫБОР
	|		КОГДА НЕ Товары.Ссылка.ЭтоМатериалы
	|			ТОГДА Товары.Ссылка.Основной
	|		ИНАЧЕ Товары.Ссылка.ОсобенностиКомплектацииПроект В (&мПроектПустой)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НЕ Товары.Ссылка.Основной,
	|	Товары.Ссылка.ПометкаУдаления";
	
	
	мПроектПустой = новый Массив;
	мПроектПустой.Добавить(неопределено);
	мПроектПустой.Добавить(Справочники.Проекты.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("номенклатура", номенклатура);
	Запрос.УстановитьПараметр("характеристика", характеристика);
	Запрос.УстановитьПараметр("КоличествоКомплектов", Количество);
	Запрос.УстановитьПараметр("мПроектПустой", мПроектПустой);
	
	ТаблицаКомплектующих = Запрос.Выполнить().Выгрузить();
	ТаблицаКомплектующих.Колонки.Добавить("ПутьВСборке");
	ТаблицаКомплектующих.Колонки.Добавить("ПутьВСборкеНоменклатура");
	
	мСтрУдалить = новый Массив;	
	тчСоставПодСборок = ТаблицаКомплектующих.СкопироватьКолонки();
	
	Для Каждого Стр из ТаблицаКомплектующих Цикл		
		//мСтрУдалить.Добавить(стр);
		путьНаУзле = ПутьВСборке + ?(ЗначениеЗаполнено(ПутьВСборке), ".","") + Прав(1000+Стр.НомерСтроки, 3); 
		путьНаУзлеНоменклатура =  ПутьВСборкеНоменклатура + ?(ЗначениеЗаполнено(ПутьВСборкеНоменклатура), " \ ","") + Строка(Стр.УзелНоменклатура); 
		стр.ПутьВСборке = путьНаУзле;
		стр.ПутьВСборкеНоменклатура = путьНаУзлеНоменклатура;
		
		тчСостав = ПолучитьКомплектующиеНоменклатурыПолный(Стр.Номенклатура, Стр.Характеристика, стр.Количество, путьНаУзле, путьНаУзлеНоменклатура);
		Если тчСостав.Количество() > 0 Тогда
			АЛСАВ_Сборка.ЗагрузитьДанныеВТЧ(тчСоставПодСборок,тчСостав);
		КонецЕсли;		
	КонецЦикла;
	
	//Для Каждого СтрУдалить из мСтрУдалить Цикл
	//	ТаблицаКомплектующих.Удалить(СтрУдалить);
	//КонецЦикла;
	АЛСАВ_Сборка.ЗагрузитьДанныеВТЧ(ТаблицаКомплектующих,тчСоставПодСборок);
	
	//Если РаскрыватьПодСборки = Ложь Тогда
	//	ТаблицаКомплектующих.Колонки.Добавить("НомерСтроки");
	//	инд = 0;
	//	Для Каждого Стр из ТаблицаКомплектующих Цикл
	//		инд = инд + 1;
	//		Стр.НомерСтроки = инд;
	//	КонецЦИкла;
	//КонецЕсли;
	
	Возврат ТаблицаКомплектующих;

КонецФункции
